УправлениеПаркомАттракционов/src/Documents/ЗаказНаряд/ЗаказНаряд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаряд</name>
  <attributes>
    <name>Аттракцион</name>
    <type>
      <types>CatalogRef.Аттракционы</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>ВидРаботы</name>
      <type>
        <types>CatalogRef.ВидыРаботОбслуживанияАттакционов</types>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеПаркомАттракционов/src/Catalogs/ЭмитентыJWT/ЭмитентыJWT.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭмитентыJWT</name>
  <predefined>
    <items>
      <name>ЭмитентМобильногоПриложения</name>
      <description>Эмитент мобильного приложения</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяЭмитента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>ИмяПолучателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УправлениеПаркомАттракционов/src/CommonModules/ОбменРемонтАттракционовМобильный/Module.bsl
Функция ПолучитьТокен(Запрос) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПоддерживаетсяТокенДоступа", Ложь);
	Результат.Вставить("ТокенДоступа", "");
	
	УстановитьПривилегированныйРежим(Истина);
	Эмитент = Справочники.ЭмитентыJWT.ЭмитентМобильногоПриложения;
	Используется = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Эмитент, "Используется");
	Если Используется Тогда
		Результат.ТокенДоступа = ТокеныДоступа.СформироватьТокенДоступа(Эмитент);
		Результат.ПоддерживаетсяТокенДоступа = Истина;
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	ТелоОтвета = ЗаписатьЗначениеJSON(Результат);
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьСправочники(Запрос) Экспорт
	
	Узел = ИдентифицироватьМобильноеУстройство(Запрос);
	
	НомерПринятогоСтрока = Запрос.Заголовки.Получить("x-last-message");
	Если ЗначениеЗаполнено(НомерПринятогоСтрока) Тогда
		НомерПринятогоСообщения = Число(НомерПринятогоСтрока);
	Иначе
		НомерПринятогоСообщения = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерПринятогоСообщения) Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НомерПринятогоСообщения);
	КонецЕсли;	
	
	ОбъектыДляПередачи = ПолучитьСправочникиДляПередачи(Узел);
	
	НомерСообщения = НомерПринятогоСообщения + 1;
	
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел, НомерСообщения, ОбъектыДляПередачи.Ссылки);
	
	ИзмененныеОбъекты = Новый Массив;
	
	Пока ВыборкаИзменений.Следующий() Цикл
		
		Объект = ВыборкаИзменений.Получить();
		
		Если ТипЗнч(Объект) = Тип("СправочникОбъект.Аттракционы") Тогда
			ОписаниеОбъекта = ОписаниеАттракциона(Объект);
		ИначеЕсли ТипЗнч(Объект) = Тип("СправочникОбъект.Материалы") Тогда
			ОписаниеОбъекта = ОписаниеМатериала(Объект);
		ИначеЕсли ТипЗнч(Объект) = Тип("СправочникОбъект.ВидыРаботОбслуживанияАттакционов") Тогда
			ОписаниеОбъекта = ОписаниеВидаРаботОбслуживанияАттракциона(Объект);
		КонецЕсли;
		
		ИзмененныеОбъекты.Добавить(ОписаниеОбъекта);
		
	КонецЦикла;
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("ИзмененныеОбъекты", ИзмененныеОбъекты);
	ДанныеОтвета.Вставить("ЕстьЕщеДанные", ОбъектыДляПередачи.ЕстьЕщеДанные);
	
	ТелоОтвета = ЗаписатьЗначениеJSON(ДанныеОтвета);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	Возврат Ответ;
	
КонецФункции

Функция ОписаниеАттракциона(Объект)
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", Строка(Объект.Ссылка.УникальныйИдентификатор()));
	Результат.Вставить("Код", Объект.Код);
	Результат.Вставить("Наименование", Объект.Наименование);
	Результат.Вставить("Недействителен", Объект.Недействителен);
	Результат.Вставить("Тип", "Аттракционы");
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеМатериала(Объект)
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", Строка(Объект.Ссылка.УникальныйИдентификатор()));
	Результат.Вставить("Код", Объект.Код);
	Результат.Вставить("Наименование", Объект.Наименование);
	Результат.Вставить("Недействителен", Объект.Недействителен);
	Результат.Вставить("Тип", "Материалы");
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеВидаРаботОбслуживанияАттракциона(Объект)
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", Строка(Объект.Ссылка.УникальныйИдентификатор()));
	Результат.Вставить("Код", Объект.Код);
	Результат.Вставить("Наименование", Объект.Наименование);
	Результат.Вставить("Недействителен", Объект.Недействителен);
	Результат.Вставить("Тип", "ВидыРаботОбслуживанияАттакционов");
	
	Возврат Результат;
	
КонецФункции

Функция ИдентифицироватьМобильноеУстройство(Запрос)
	
	ИдентификаторКлиента = Запрос.Заголовки.Получить("x-client-id");
	ОСКлиента = Запрос.Заголовки.Получить("x-client-os");
	Пользователь = Пользователи.ТекущийПользователь();
	
	Результат = ПланыОбмена.ОбменРемонтАттракционов.НайтиПоКоду(ИдентификаторКлиента);
	
	Если Результат.Пустая() Тогда
		УзелОбъект = ПланыОбмена.ОбменРемонтАттракционов.СоздатьУзел();
		УзелОбъект.Код = ИдентификаторКлиента;
		УзелОбъект.Наименование = ОСКлиента;
		УзелОбъект.Пользователь = Пользователь;
		УзелОбъект.Записать();
		Результат = УзелОбъект.Ссылка;
		ВыполнитьНачальнуюРегистрацию(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьНачальнуюРегистрацию(Узел)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Аттракционы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Аттракционы КАК Аттракционы
		|ГДЕ
		|	НЕ Аттракционы.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВидыРаботОбслуживанияАттакционов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыРаботОбслуживанияАттакционов КАК ВидыРаботОбслуживанияАттакционов
		|ГДЕ
		|	НЕ ВидыРаботОбслуживанияАттакционов.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Материалы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Материалы КАК Материалы
		|ГДЕ
		|	НЕ Материалы.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.Исполнитель = &Исполнитель
		|	И НЕ ЗаказНаряд.ПометкаУдаления";
		
	Запрос.УстановитьПараметр("Исполнитель", Пользователи.ТекущийПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СсылкиДляРегистрации = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		СсылкиДляРегистрации.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СсылкиДляРегистрации) Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, СсылкиДляРегистрации);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСправочникиДляПередачи(Узел)
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьЕщеДанные", Ложь);
	Результат.Вставить("Ссылки", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 101
		|	Т.Ссылка КАК Ссылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		АттракционыИзменения.Ссылка КАК Ссылка
		|	ИЗ
		|		Справочник.Аттракционы.Изменения КАК АттракционыИзменения
		|	ГДЕ
		|		АттракционыИзменения.Узел = &Узел
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ВидыРаботОбслуживанияАттакционовИзменения.Ссылка КАК Ссылка
		|	ИЗ
		|		Справочник.ВидыРаботОбслуживанияАттакционов.Изменения КАК ВидыРаботОбслуживанияАттакционовИзменения
		|	ГДЕ
		|		ВидыРаботОбслуживанияАттакционовИзменения.Узел = &Узел
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		МатериалыИзменения.Ссылка КАК Ссылка
		|	ИЗ
		|		Справочник.Материалы.Изменения КАК МатериалыИзменения
		|	ГДЕ
		|		МатериалыИзменения.Узел = &Узел) КАК Т";
		
	Запрос.УстановитьПараметр("Узел", Узел);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 100 Тогда
		Результат.ЕстьЕщеДанные = Истина;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		Результат.Ссылки.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Если Результат.ЕстьЕщеДанные Тогда
		Результат.Ссылки.Удалить(100);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
